loadtest/tmp-prod-100vu-www/summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtest/k6-browse.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 2m50s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 2m20s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 004/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 004/100 VUs  0m01.0s/2m20.0s

running (0m02.0s), 007/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 007/100 VUs  0m02.0s/2m20.0s

running (0m03.0s), 010/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 010/100 VUs  0m03.0s/2m20.0s

running (0m04.0s), 014/100 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 014/100 VUs  0m04.0s/2m20.0s

running (0m05.0s), 017/100 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 017/100 VUs  0m05.0s/2m20.0s

running (0m06.0s), 020/100 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 020/100 VUs  0m06.0s/2m20.0s

running (0m07.0s), 024/100 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 024/100 VUs  0m07.0s/2m20.0s

running (0m08.0s), 027/100 VUs, 1 complete and 0 interrupted iterations
default   [   6% ] 027/100 VUs  0m08.0s/2m20.0s

running (0m09.0s), 030/100 VUs, 3 complete and 0 interrupted iterations
default   [   6% ] 030/100 VUs  0m09.0s/2m20.0s

running (0m10.0s), 033/100 VUs, 5 complete and 0 interrupted iterations
default   [   7% ] 033/100 VUs  0m10.0s/2m20.0s

running (0m11.0s), 037/100 VUs, 5 complete and 0 interrupted iterations
default   [   8% ] 037/100 VUs  0m11.0s/2m20.0s

running (0m12.0s), 040/100 VUs, 7 complete and 0 interrupted iterations
default   [   9% ] 040/100 VUs  0m12.0s/2m20.0s

running (0m13.0s), 043/100 VUs, 7 complete and 0 interrupted iterations
default   [   9% ] 043/100 VUs  0m13.0s/2m20.0s

running (0m14.0s), 047/100 VUs, 10 complete and 0 interrupted iterations
default   [  10% ] 047/100 VUs  0m14.0s/2m20.0s

running (0m15.0s), 050/100 VUs, 10 complete and 0 interrupted iterations
default   [  11% ] 050/100 VUs  0m15.0s/2m20.0s

running (0m16.0s), 053/100 VUs, 13 complete and 0 interrupted iterations
default   [  11% ] 053/100 VUs  0m16.0s/2m20.0s

running (0m17.0s), 057/100 VUs, 16 complete and 0 interrupted iterations
default   [  12% ] 057/100 VUs  0m17.0s/2m20.0s

running (0m18.0s), 060/100 VUs, 18 complete and 0 interrupted iterations
default   [  13% ] 060/100 VUs  0m18.0s/2m20.0s

running (0m19.0s), 063/100 VUs, 20 complete and 0 interrupted iterations
default   [  14% ] 063/100 VUs  0m19.0s/2m20.0s

running (0m20.0s), 066/100 VUs, 22 complete and 0 interrupted iterations
default   [  14% ] 066/100 VUs  0m20.0s/2m20.0s

running (0m21.0s), 070/100 VUs, 25 complete and 0 interrupted iterations
default   [  15% ] 070/100 VUs  0m21.0s/2m20.0s

running (0m22.0s), 073/100 VUs, 29 complete and 0 interrupted iterations
default   [  16% ] 073/100 VUs  0m22.0s/2m20.0s

running (0m23.0s), 076/100 VUs, 31 complete and 0 interrupted iterations
default   [  16% ] 076/100 VUs  0m23.0s/2m20.0s

running (0m24.0s), 080/100 VUs, 32 complete and 0 interrupted iterations
default   [  17% ] 080/100 VUs  0m24.0s/2m20.0s

running (0m25.0s), 083/100 VUs, 34 complete and 0 interrupted iterations
default   [  18% ] 083/100 VUs  0m25.0s/2m20.0s

running (0m26.0s), 086/100 VUs, 39 complete and 0 interrupted iterations
default   [  19% ] 086/100 VUs  0m26.0s/2m20.0s

running (0m27.0s), 089/100 VUs, 41 complete and 0 interrupted iterations
default   [  19% ] 089/100 VUs  0m27.0s/2m20.0s

running (0m28.0s), 093/100 VUs, 44 complete and 0 interrupted iterations
default   [  20% ] 093/100 VUs  0m28.0s/2m20.0s

running (0m29.0s), 096/100 VUs, 47 complete and 0 interrupted iterations
default   [  21% ] 096/100 VUs  0m29.0s/2m20.0s

running (0m30.0s), 099/100 VUs, 47 complete and 0 interrupted iterations
default   [  21% ] 099/100 VUs  0m30.0s/2m20.0s

running (0m31.0s), 100/100 VUs, 52 complete and 0 interrupted iterations
default   [  22% ] 100/100 VUs  0m31.0s/2m20.0s

running (0m32.0s), 100/100 VUs, 57 complete and 0 interrupted iterations
default   [  23% ] 100/100 VUs  0m32.0s/2m20.0s

running (0m33.0s), 100/100 VUs, 63 complete and 0 interrupted iterations
default   [  24% ] 100/100 VUs  0m33.0s/2m20.0s

running (0m34.0s), 100/100 VUs, 63 complete and 0 interrupted iterations
default   [  24% ] 100/100 VUs  0m34.0s/2m20.0s

running (0m35.0s), 100/100 VUs, 63 complete and 0 interrupted iterations
default   [  25% ] 100/100 VUs  0m35.0s/2m20.0s

running (0m36.0s), 100/100 VUs, 65 complete and 0 interrupted iterations
default   [  26% ] 100/100 VUs  0m36.0s/2m20.0s

running (0m37.0s), 100/100 VUs, 67 complete and 0 interrupted iterations
default   [  26% ] 100/100 VUs  0m37.0s/2m20.0s

running (0m38.0s), 100/100 VUs, 68 complete and 0 interrupted iterations
default   [  27% ] 100/100 VUs  0m38.0s/2m20.0s

running (0m39.0s), 100/100 VUs, 72 complete and 0 interrupted iterations
default   [  28% ] 100/100 VUs  0m39.0s/2m20.0s

running (0m40.0s), 100/100 VUs, 83 complete and 0 interrupted iterations
default   [  29% ] 100/100 VUs  0m40.0s/2m20.0s

running (0m41.0s), 100/100 VUs, 89 complete and 0 interrupted iterations
default   [  29% ] 100/100 VUs  0m41.0s/2m20.0s

running (0m42.0s), 100/100 VUs, 91 complete and 0 interrupted iterations
default   [  30% ] 100/100 VUs  0m42.0s/2m20.0s

running (0m43.0s), 100/100 VUs, 96 complete and 0 interrupted iterations
default   [  31% ] 100/100 VUs  0m43.0s/2m20.0s

running (0m44.0s), 100/100 VUs, 96 complete and 0 interrupted iterations
default   [  31% ] 100/100 VUs  0m44.0s/2m20.0s

running (0m45.0s), 100/100 VUs, 96 complete and 0 interrupted iterations
default   [  32% ] 100/100 VUs  0m45.0s/2m20.0s

running (0m46.0s), 100/100 VUs, 98 complete and 0 interrupted iterations
default   [  33% ] 100/100 VUs  0m46.0s/2m20.0s

running (0m47.0s), 100/100 VUs, 104 complete and 0 interrupted iterations
default   [  34% ] 100/100 VUs  0m47.0s/2m20.0s

running (0m48.0s), 100/100 VUs, 115 complete and 0 interrupted iterations
default   [  34% ] 100/100 VUs  0m48.0s/2m20.0s

running (0m49.0s), 100/100 VUs, 130 complete and 0 interrupted iterations
default   [  35% ] 100/100 VUs  0m49.0s/2m20.0s

running (0m50.0s), 100/100 VUs, 136 complete and 0 interrupted iterations
default   [  36% ] 100/100 VUs  0m50.0s/2m20.0s

running (0m51.0s), 100/100 VUs, 138 complete and 0 interrupted iterations
default   [  36% ] 100/100 VUs  0m51.0s/2m20.0s

running (0m52.0s), 100/100 VUs, 142 complete and 0 interrupted iterations
default   [  37% ] 100/100 VUs  0m52.0s/2m20.0s

running (0m53.0s), 100/100 VUs, 142 complete and 0 interrupted iterations
default   [  38% ] 100/100 VUs  0m53.0s/2m20.0s

running (0m54.0s), 100/100 VUs, 142 complete and 0 interrupted iterations
default   [  39% ] 100/100 VUs  0m54.0s/2m20.0s

running (0m55.0s), 100/100 VUs, 150 complete and 0 interrupted iterations
default   [  39% ] 100/100 VUs  0m55.0s/2m20.0s

running (0m56.0s), 100/100 VUs, 154 complete and 0 interrupted iterations
default   [  40% ] 100/100 VUs  0m56.0s/2m20.0s

running (0m57.0s), 100/100 VUs, 166 complete and 0 interrupted iterations
default   [  41% ] 100/100 VUs  0m57.0s/2m20.0s

running (0m58.0s), 100/100 VUs, 174 complete and 0 interrupted iterations
default   [  41% ] 100/100 VUs  0m58.0s/2m20.0s

running (0m59.0s), 100/100 VUs, 177 complete and 0 interrupted iterations
default   [  42% ] 100/100 VUs  0m59.0s/2m20.0s

running (1m00.0s), 100/100 VUs, 181 complete and 0 interrupted iterations
default   [  43% ] 100/100 VUs  1m00.0s/2m20.0s

running (1m01.0s), 100/100 VUs, 184 complete and 0 interrupted iterations
default   [  44% ] 100/100 VUs  1m01.0s/2m20.0s

running (1m02.0s), 100/100 VUs, 184 complete and 0 interrupted iterations
default   [  44% ] 100/100 VUs  1m02.0s/2m20.0s

running (1m03.0s), 100/100 VUs, 187 complete and 0 interrupted iterations
default   [  45% ] 100/100 VUs  1m03.0s/2m20.0s

running (1m04.0s), 100/100 VUs, 191 complete and 0 interrupted iterations
default   [  46% ] 100/100 VUs  1m04.0s/2m20.0s

running (1m05.0s), 100/100 VUs, 197 complete and 0 interrupted iterations
default   [  46% ] 100/100 VUs  1m05.0s/2m20.0s

running (1m06.0s), 100/100 VUs, 209 complete and 0 interrupted iterations
default   [  47% ] 100/100 VUs  1m06.0s/2m20.0s

running (1m07.0s), 100/100 VUs, 216 complete and 0 interrupted iterations
default   [  48% ] 100/100 VUs  1m07.0s/2m20.0s

running (1m08.0s), 100/100 VUs, 224 complete and 0 interrupted iterations
default   [  49% ] 100/100 VUs  1m08.0s/2m20.0s

running (1m09.0s), 100/100 VUs, 229 complete and 0 interrupted iterations
default   [  49% ] 100/100 VUs  1m09.0s/2m20.0s

running (1m10.0s), 100/100 VUs, 234 complete and 0 interrupted iterations
default   [  50% ] 100/100 VUs  1m10.0s/2m20.0s

running (1m11.0s), 100/100 VUs, 238 complete and 0 interrupted iterations
default   [  51% ] 100/100 VUs  1m11.0s/2m20.0s

running (1m12.0s), 100/100 VUs, 238 complete and 0 interrupted iterations
default   [  51% ] 100/100 VUs  1m12.0s/2m20.0s

running (1m13.0s), 100/100 VUs, 239 complete and 0 interrupted iterations
default   [  52% ] 100/100 VUs  1m13.0s/2m20.0s

running (1m14.0s), 100/100 VUs, 239 complete and 0 interrupted iterations
default   [  53% ] 100/100 VUs  1m14.0s/2m20.0s

running (1m15.0s), 100/100 VUs, 244 complete and 0 interrupted iterations
default   [  54% ] 100/100 VUs  1m15.0s/2m20.0s

running (1m16.0s), 100/100 VUs, 255 complete and 0 interrupted iterations
default   [  54% ] 100/100 VUs  1m16.0s/2m20.0s

running (1m17.0s), 100/100 VUs, 261 complete and 0 interrupted iterations
default   [  55% ] 100/100 VUs  1m17.0s/2m20.0s

running (1m18.0s), 100/100 VUs, 268 complete and 0 interrupted iterations
default   [  56% ] 100/100 VUs  1m18.0s/2m20.0s

running (1m19.0s), 100/100 VUs, 269 complete and 0 interrupted iterations
default   [  56% ] 100/100 VUs  1m19.0s/2m20.0s

running (1m20.0s), 100/100 VUs, 272 complete and 0 interrupted iterations
default   [  57% ] 100/100 VUs  1m20.0s/2m20.0s

running (1m21.0s), 100/100 VUs, 272 complete and 0 interrupted iterations
default   [  58% ] 100/100 VUs  1m21.0s/2m20.0s

running (1m22.0s), 100/100 VUs, 273 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  1m22.0s/2m20.0s

running (1m23.0s), 100/100 VUs, 274 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  1m23.0s/2m20.0s

running (1m24.0s), 100/100 VUs, 277 complete and 0 interrupted iterations
default   [  60% ] 100/100 VUs  1m24.0s/2m20.0s

running (1m25.0s), 100/100 VUs, 287 complete and 0 interrupted iterations
default   [  61% ] 100/100 VUs  1m25.0s/2m20.0s

running (1m26.0s), 100/100 VUs, 292 complete and 0 interrupted iterations
default   [  61% ] 100/100 VUs  1m26.0s/2m20.0s

running (1m27.0s), 100/100 VUs, 297 complete and 0 interrupted iterations
default   [  62% ] 100/100 VUs  1m27.0s/2m20.0s

running (1m28.0s), 100/100 VUs, 300 complete and 0 interrupted iterations
default   [  63% ] 100/100 VUs  1m28.0s/2m20.0s

running (1m29.0s), 100/100 VUs, 301 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  1m29.0s/2m20.0s

running (1m30.0s), 100/100 VUs, 305 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  1m30.0s/2m20.0s

running (1m31.0s), 100/100 VUs, 309 complete and 0 interrupted iterations
default   [  65% ] 100/100 VUs  1m31.0s/2m20.0s

running (1m32.0s), 100/100 VUs, 310 complete and 0 interrupted iterations
default   [  66% ] 100/100 VUs  1m32.0s/2m20.0s

running (1m33.0s), 100/100 VUs, 319 complete and 0 interrupted iterations
default   [  66% ] 100/100 VUs  1m33.0s/2m20.0s

running (1m34.0s), 100/100 VUs, 333 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  1m34.0s/2m20.0s

running (1m35.0s), 100/100 VUs, 338 complete and 0 interrupted iterations
default   [  68% ] 100/100 VUs  1m35.0s/2m20.0s

running (1m36.0s), 100/100 VUs, 343 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  1m36.0s/2m20.0s

running (1m37.0s), 100/100 VUs, 343 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  1m37.0s/2m20.0s

running (1m38.0s), 100/100 VUs, 343 complete and 0 interrupted iterations
default   [  70% ] 100/100 VUs  1m38.0s/2m20.0s

running (1m39.0s), 100/100 VUs, 345 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  1m39.0s/2m20.0s

running (1m40.0s), 100/100 VUs, 348 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  1m40.0s/2m20.0s

running (1m41.0s), 100/100 VUs, 353 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  1m41.0s/2m20.0s

running (1m42.0s), 100/100 VUs, 357 complete and 0 interrupted iterations
default   [  73% ] 100/100 VUs  1m42.0s/2m20.0s

running (1m43.0s), 100/100 VUs, 362 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  1m43.0s/2m20.0s

running (1m44.0s), 100/100 VUs, 370 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  1m44.0s/2m20.0s

running (1m45.0s), 100/100 VUs, 375 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  1m45.0s/2m20.0s

running (1m46.0s), 100/100 VUs, 375 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  1m46.0s/2m20.0s

running (1m47.0s), 100/100 VUs, 376 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  1m47.0s/2m20.0s

running (1m48.0s), 100/100 VUs, 378 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  1m48.0s/2m20.0s

running (1m49.0s), 100/100 VUs, 379 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  1m49.0s/2m20.0s

running (1m50.0s), 100/100 VUs, 381 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  1m50.0s/2m20.0s

running (1m51.0s), 100/100 VUs, 381 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  1m51.0s/2m20.0s

running (1m52.0s), 100/100 VUs, 389 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  1m52.0s/2m20.0s

running (1m53.0s), 100/100 VUs, 394 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  1m53.0s/2m20.0s

running (1m54.0s), 100/100 VUs, 405 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  1m54.0s/2m20.0s

running (1m55.0s), 100/100 VUs, 412 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  1m55.0s/2m20.0s

running (1m56.0s), 100/100 VUs, 420 complete and 0 interrupted iterations
default   [  83% ] 100/100 VUs  1m56.0s/2m20.0s

running (1m57.0s), 100/100 VUs, 428 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  1m57.0s/2m20.0s

running (1m58.0s), 100/100 VUs, 433 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  1m58.0s/2m20.0s

running (1m59.0s), 100/100 VUs, 434 complete and 0 interrupted iterations
default   [  85% ] 100/100 VUs  1m59.0s/2m20.0s

running (2m00.0s), 100/100 VUs, 435 complete and 0 interrupted iterations
default   [  86% ] 100/100 VUs  2m00.0s/2m20.0s

running (2m01.0s), 100/100 VUs, 437 complete and 0 interrupted iterations
default   [  86% ] 100/100 VUs  2m01.0s/2m20.0s

running (2m02.0s), 100/100 VUs, 441 complete and 0 interrupted iterations
default   [  87% ] 100/100 VUs  2m02.0s/2m20.0s

running (2m03.0s), 100/100 VUs, 447 complete and 0 interrupted iterations
default   [  88% ] 100/100 VUs  2m03.0s/2m20.0s

running (2m04.0s), 100/100 VUs, 451 complete and 0 interrupted iterations
default   [  89% ] 100/100 VUs  2m04.0s/2m20.0s

running (2m05.0s), 100/100 VUs, 454 complete and 0 interrupted iterations
default   [  89% ] 100/100 VUs  2m05.0s/2m20.0s

running (2m06.0s), 099/100 VUs, 458 complete and 0 interrupted iterations
default   [  90% ] 099/100 VUs  2m06.0s/2m20.0s

running (2m07.0s), 098/100 VUs, 461 complete and 0 interrupted iterations
default   [  91% ] 098/100 VUs  2m07.0s/2m20.0s

running (2m08.0s), 097/100 VUs, 467 complete and 0 interrupted iterations
default   [  91% ] 097/100 VUs  2m08.0s/2m20.0s

running (2m09.0s), 097/100 VUs, 467 complete and 0 interrupted iterations
default   [  92% ] 097/100 VUs  2m09.0s/2m20.0s

running (2m10.0s), 095/100 VUs, 469 complete and 0 interrupted iterations
default   [  93% ] 095/100 VUs  2m10.0s/2m20.0s

running (2m11.0s), 095/100 VUs, 470 complete and 0 interrupted iterations
default   [  94% ] 095/100 VUs  2m11.0s/2m20.0s

running (2m12.0s), 095/100 VUs, 473 complete and 0 interrupted iterations
default   [  94% ] 095/100 VUs  2m12.0s/2m20.0s

running (2m13.0s), 088/100 VUs, 482 complete and 0 interrupted iterations
default   [  95% ] 088/100 VUs  2m13.0s/2m20.0s

running (2m14.0s), 084/100 VUs, 491 complete and 0 interrupted iterations
default   [  96% ] 084/100 VUs  2m14.0s/2m20.0s

running (2m15.0s), 075/100 VUs, 504 complete and 0 interrupted iterations
default   [  96% ] 075/100 VUs  2m15.0s/2m20.0s

running (2m16.0s), 070/100 VUs, 511 complete and 0 interrupted iterations
default   [  97% ] 070/100 VUs  2m16.0s/2m20.0s

running (2m17.0s), 065/100 VUs, 517 complete and 0 interrupted iterations
default   [  98% ] 065/100 VUs  2m17.0s/2m20.0s

running (2m18.0s), 061/100 VUs, 521 complete and 0 interrupted iterations
default   [  99% ] 061/100 VUs  2m18.0s/2m20.0s

running (2m19.0s), 057/100 VUs, 526 complete and 0 interrupted iterations
default   [  99% ] 057/100 VUs  2m19.0s/2m20.0s

running (2m20.0s), 045/100 VUs, 538 complete and 0 interrupted iterations
default   [ 100% ] 045/100 VUs  2m20.0s/2m20.0s

running (2m21.0s), 041/100 VUs, 542 complete and 0 interrupted iterations
default ↓ [ 100% ] 045/100 VUs  2m20s

running (2m22.0s), 036/100 VUs, 547 complete and 0 interrupted iterations
default ↓ [ 100% ] 045/100 VUs  2m20s

running (2m23.0s), 028/100 VUs, 555 complete and 0 interrupted iterations
default ↓ [ 100% ] 045/100 VUs  2m20s

running (2m24.0s), 020/100 VUs, 563 complete and 0 interrupted iterations
default ↓ [ 100% ] 045/100 VUs  2m20s

running (2m25.0s), 013/100 VUs, 570 complete and 0 interrupted iterations
default ↓ [ 100% ] 045/100 VUs  2m20s

running (2m26.0s), 010/100 VUs, 573 complete and 0 interrupted iterations
default ↓ [ 100% ] 045/100 VUs  2m20s

running (2m27.0s), 006/100 VUs, 577 complete and 0 interrupted iterations
default ↓ [ 100% ] 045/100 VUs  2m20s

running (2m28.0s), 005/100 VUs, 578 complete and 0 interrupted iterations
default ↓ [ 100% ] 045/100 VUs  2m20s

running (2m29.0s), 005/100 VUs, 578 complete and 0 interrupted iterations
default ↓ [ 100% ] 045/100 VUs  2m20s

running (2m30.0s), 005/100 VUs, 578 complete and 0 interrupted iterations
default ↓ [ 100% ] 045/100 VUs  2m20s

running (2m31.0s), 003/100 VUs, 580 complete and 0 interrupted iterations
default ↓ [ 100% ] 045/100 VUs  2m20s

running (2m32.0s), 003/100 VUs, 580 complete and 0 interrupted iterations
default ↓ [ 100% ] 045/100 VUs  2m20s

running (2m33.0s), 002/100 VUs, 581 complete and 0 interrupted iterations
default ↓ [ 100% ] 045/100 VUs  2m20s

running (2m34.0s), 002/100 VUs, 581 complete and 0 interrupted iterations
default ↓ [ 100% ] 045/100 VUs  2m20s

running (2m35.0s), 002/100 VUs, 581 complete and 0 interrupted iterations
default ↓ [ 100% ] 045/100 VUs  2m20s


  █ THRESHOLDS 

    http_req_duration{group:::categoria}
    ✗ 'p(95)<1500' p(95)=7.12s
    ✗ 'p(99)<2500' p(99)=8.45s

    http_req_duration{group:::categorias_listado}
    ✗ 'p(95)<1200' p(95)=7.53s
    ✗ 'p(99)<2000' p(99)=8.73s

    http_req_duration{group:::checkout_shell}
    ✗ 'p(95)<1500' p(95)=7.25s
    ✗ 'p(99)<2500' p(99)=7.59s

    http_req_duration{group:::home}
    ✗ 'p(95)<1500' p(95)=8.23s
    ✗ 'p(99)<2500' p(99)=10.77s

    http_req_duration{group:::listado_productos}
    ✗ 'p(95)<1500' p(95)=9.92s
    ✗ 'p(99)<2500' p(99)=12.91s

    http_req_duration{group:::paginas_estaticas}
    ✗ 'p(95)<800' p(95)=6.53s
    ✗ 'p(99)<1500' p(99)=7.19s

    http_req_duration{group:::producto}
    ✗ 'p(95)<1200' p(95)=7.56s
    ✗ 'p(99)<2000' p(99)=8.92s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    solicitudes_a_rutas_prohibidas
    ✓ 'count==0' count=0


  █ TOTAL RESULTS 

    checks_total.......: 5820    37.398489/s
    checks_succeeded...: 100.00% 5820 out of 5820
    checks_failed......: 0.00%   0 out of 5820

    ✓ status es 200
    ✓ no es 5xx
    ✓ respuesta no vacía

    CUSTOM
    cliente_descarga...................: avg=2.82s   min=38.81ms  med=2.19s    max=36.41s p(90)=5.99s  p(95)=7s       p(99)=9.57s   
    cliente_dns_bloqueo................: avg=83.01ms min=0s       med=0s       max=6.56s  p(90)=0s     p(95)=222.98ms p(99)=2.76s   
    cliente_tcp_conexion...............: avg=31.16ms min=0s       med=0s       max=1.91s  p(90)=0s     p(95)=71.3ms   p(99)=957.12ms
    cliente_tiempo_total...............: avg=3.87s   min=184.99ms med=3.64s    max=37.06s p(90)=7.28s  p(95)=8.24s    p(99)=10.89s  
    cliente_tls_handshake..............: avg=51.83ms min=0s       med=0s       max=5.74s  p(90)=0s     p(95)=124.62ms p(99)=1.71s   
    cliente_ttfb_espera................: avg=1.05s   min=75.74ms  med=851.86ms max=6.61s  p(90)=2.13s  p(95)=2.85s    p(99)=4.24s   
    http_estado_2xx....................: 1940   12.466163/s
    solicitudes_a_rutas_prohibidas.....: 0      0/s
    vercel_cache_hit...................: 1815   11.662931/s
    vercel_cache_hit_categoria.........: 263    1.69/s
    vercel_cache_hit_categorias........: 108    0.693993/s
    vercel_cache_hit_checkout..........: 44     0.282738/s
    vercel_cache_hit_home..............: 582    3.739849/s
    vercel_cache_hit_producto..........: 362    2.32616/s
    vercel_cache_hit_products..........: 401    2.576769/s
    vercel_cache_miss..................: 1      0.006426/s
    vercel_cache_miss_producto.........: 1      0.006426/s
    vercel_cache_stale.................: 124    0.796806/s
    vercel_cache_stale_categoria.......: 12     0.07711/s
    vercel_cache_stale_categorias......: 1      0.006426/s
    vercel_cache_stale_checkout........: 1      0.006426/s
    vercel_cache_stale_home............: 1      0.006426/s
    vercel_cache_stale_producto........: 105    0.674715/s
    vercel_cache_stale_products........: 1      0.006426/s

    HTTP
    http_req_duration..................: avg=3.87s   min=184.99ms med=3.64s    max=37.06s p(90)=7.28s  p(95)=8.24s    p(99)=10.89s  
      { expected_response:true }.......: avg=3.87s   min=184.99ms med=3.64s    max=37.06s p(90)=7.28s  p(95)=8.24s    p(99)=10.89s  
      { group:::categoria }............: avg=3.35s   min=184.99ms med=3.07s    max=10.35s p(90)=6.65s  p(95)=7.12s    p(99)=8.45s   
      { group:::categorias_listado }...: avg=3.25s   min=215.72ms med=2.75s    max=13.78s p(90)=6.32s  p(95)=7.53s    p(99)=8.73s   
      { group:::checkout_shell }.......: avg=3.56s   min=282.16ms med=4.21s    max=7.79s  p(90)=6.55s  p(95)=7.25s    p(99)=7.59s   
      { group:::home }.................: avg=3.93s   min=217.29ms med=3.74s    max=37.06s p(90)=7.34s  p(95)=8.23s    p(99)=10.77s  
      { group:::listado_productos }....: avg=5.04s   min=383.51ms med=4.99s    max=22.63s p(90)=8.78s  p(95)=9.92s    p(99)=12.91s  
      { group:::paginas_estaticas }....: avg=2.84s   min=325.14ms med=2.54s    max=7.8s   p(90)=6.05s  p(95)=6.53s    p(99)=7.19s   
      { group:::producto }.............: avg=3.4s    min=251.25ms med=3.06s    max=11.03s p(90)=6.6s   p(95)=7.56s    p(99)=8.92s   
    http_req_failed....................: 0.00%  0 out of 1940
    http_reqs..........................: 1940   12.466163/s

    EXECUTION
    iteration_duration.................: avg=21.35s  min=1.71s    med=20.47s   max=1m8s   p(90)=34.73s p(95)=38.51s   p(99)=49.02s  
    iterations.........................: 583    3.746275/s
    vus................................: 2      min=2         max=100
    vus_max............................: 100    min=100       max=100

    NETWORK
    data_received......................: 377 MB 2.4 MB/s
    data_sent..........................: 1.1 MB 7.0 kB/s



running (2m35.6s), 000/100 VUs, 583 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  2m20s
time="2026-09-15T16:20:36-04:00" level=error msg="thresholds on metrics 'http_req_duration{group:::categorias_listado}, http_req_duration{group:::categoria}, http_req_duration{group:::checkout_shell}, http_req_duration{group:::home}, http_req_duration{group:::listado_productos}, http_req_duration{group:::paginas_estaticas}, http_req_duration{group:::producto}' have been crossed"